import requests
import base64

print("██╗  ██╗ █████╗  ██████╗██╗  ██╗    ████████╗██╗  ██╗███████╗    ██████╗  ██████╗ ██╗  ██╗")
print("██║  ██║██╔══██╗██╔════╝██║ ██╔╝    ╚══██╔══╝██║  ██║██╔════╝    ██╔══██╗██╔═══██╗╚██╗██╔╝")
print("███████║███████║██║     █████╔╝        ██║   ███████║█████╗      ██████╔╝██║   ██║ ╚███╔╝ ")
print("██╔══██║██╔══██║██║     ██╔═██╗        ██║   ██╔══██║██╔══╝      ██╔══██╗██║   ██║ ██╔██╗ ")
print("██║  ██║██║  ██║╚██████╗██║  ██╗       ██║   ██║  ██║███████╗    ██████╔╝╚██████╔╝██╔╝ ██╗")
print("╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝       ╚═╝   ╚═╝  ╚═╝╚══════╝    ╚═════╝  ╚═════╝ ╚═╝  ╚═╝")
try:
    url = "https://www.hackthebox.eu/api/invite/generate"
    header = {'content-type': 'application/json', 'user-agent': 'Hack The Box'}
    print('[+] 正在提交请求，请稍后！')
    res = requests.post(url, headers=header)
    data = res.json()
    value = data['data']['code']
    base = base64.b64decode(value)
    print('[+] -----------------------| 获取成功 |------------------------')
    print('[+] 你的 Hack The Box 的邀请码是：' + base.decode())
    print('[+] -----------------------------------------------------------')
except:
    print('[-] 获取失败！')
